RT-Thread/rt-thread/bsp/mb9bf500r/CMSIS/mb9bf506r.h
/******************************************************************************
 * GPIO_MODULE
 ******************************************************************************/
/* General purpose I/O registers */
typedef struct
{
  __IO uint32_t PFR0;
  __IO uint32_t PFR1;
  __IO uint32_t PFR2;
  __IO uint32_t PFR3;
  __IO uint32_t PFR4;
  __IO uint32_t PFR5;
  __IO uint32_t PFR6;
  __IO uint32_t PFR7;
  __IO uint32_t PFR8;
        uint8_t RESERVED0[220];
  __IO uint32_t PCR0;
  __IO uint32_t PCR1;
  __IO uint32_t PCR2;
  __IO uint32_t PCR3;
  __IO uint32_t PCR4;
  __IO uint32_t PCR5;
  __IO uint32_t PCR6;
  __IO uint32_t PCR7;
        uint8_t RESERVED1[224];
  __IO uint32_t DDR0;
  __IO uint32_t DDR1;
  __IO uint32_t DDR2;
  __IO uint32_t DDR3;
  __IO uint32_t DDR4;
  __IO uint32_t DDR5;
  __IO uint32_t DDR6;
  __IO uint32_t DDR7;
  __IO uint32_t DDR8;
        uint8_t RESERVED2[220];
  __IO uint32_t PDIR0;
  __IO uint32_t PDIR1;
  __IO uint32_t PDIR2;
  __IO uint32_t PDIR3;
  __IO uint32_t PDIR4;
  __IO uint32_t PDIR5;
  __IO uint32_t PDIR6;
  __IO uint32_t PDIR7;
  __IO uint32_t PDIR8;
        uint8_t RESERVED3[220];
  __IO uint32_t PDOR0;
  __IO uint32_t PDOR1;
  __IO uint32_t PDOR2;
  __IO uint32_t PDOR3;
  __IO uint32_t PDOR4;
  __IO uint32_t PDOR5;
  __IO uint32_t PDOR6;
  __IO uint32_t PDOR7;
  __IO uint32_t PDOR8;
        uint8_t RESERVED4[220];
  __IO uint32_t ADE;
        uint8_t RESERVED5[124];
  __IO uint32_t SPSR;
        uint8_t RESERVED6[124];
  __IO uint32_t EPFR00;
  __IO uint32_t EPFR01;
  __IO uint32_t EPFR02;
        uint8_t RESERVED7[4];
  __IO uint32_t EPFR04;
  __IO uint32_t EPFR05;
  __IO uint32_t EPFR06;
  __IO uint32_t EPFR07;
  __IO uint32_t EPFR08;
  __IO uint32_t EPFR09;
  __IO uint32_t EPFR10;
}FM3_GPIO_TypeDef;

/******************************************************************************
 * LVD_MODULE
 ******************************************************************************/
/* Low voltage detection registers */
typedef struct
{
  __IO  uint8_t LVD_CTL;
        uint8_t RESERVED0[3];
  __IO  uint8_t LVD_STR;
        uint8_t RESERVED1[3];
  __IO  uint8_t LVD_CLR;
        uint8_t RESERVED2[3];
  __IO uint32_t LVD_RLR;
  __IO  uint8_t LVD_STR2;
}FM3_LVD_TypeDef;

/******************************************************************************
 * USBCLK
 ******************************************************************************/
/* USB clock registers */
typedef struct
{
  __IO  uint8_t UCCR;
        uint8_t RESERVED0[3];
  __IO  uint8_t UPCR1;
        uint8_t RESERVED1[3];
  __IO  uint8_t UPCR2;
        uint8_t RESERVED2[3];
  __IO  uint8_t UPCR3;
        uint8_t RESERVED3[3];
  __IO  uint8_t UPCR4;
        uint8_t RESERVED4[3];
  __IO  uint8_t UP_STR;
        uint8_t RESERVED5[3];
  __IO  uint8_t UPINT_ENR;
        uint8_t RESERVED6[3];
  __IO  uint8_t UPINT_CLR;
        uint8_t RESERVED7[3];
  __IO  uint8_t UPINT_STR;
        uint8_t RESERVED8[15];
  __IO  uint8_t USBEN;
}FM3_USBCLK_TypeDef;

/******************************************************************************
 * CANPRE_MODULE
 ******************************************************************************/
/* CAN prescaler register */
typedef struct
{
  __IO  uint8_t CANPRE;
}FM3_CANPRE_TypeDef;

/******************************************************************************
 * MFS03_UART_MODULE
 ******************************************************************************/
/* UART asynchronous channel 0 registers */
typedef struct
{
  __IO  uint8_t SMR;
  __IO  uint8_t SCR;
        uint8_t RESERVED0[2];
  __IO  uint8_t ESCR;
  __IO  uint8_t SSR;
        uint8_t RESERVED1[2];
  union {
    __IO uint16_t RDR;
    __IO uint16_t TDR;
  };
        uint8_t RESERVED2[2];
  union {
    __IO uint16_t BGR;
    struct {
      __IO  uint8_t BGR0;
      __IO  uint8_t BGR1;
    };
  };
}FM3_MFS03_UART_TypeDef;

/******************************************************************************
 * MFS03_CSIO_MODULE
 ******************************************************************************/
/* UART synchronous channel 0 registers */
typedef struct
{
  __IO  uint8_t SMR;
  __IO  uint8_t SCR;
        uint8_t RESERVED0[2];
  __IO  uint8_t ESCR;
  __IO  uint8_t SSR;
        uint8_t RESERVED1[2];
  union {
    __IO uint16_t RDR;
    __IO uint16_t TDR;
  };
        uint8_t RESERVED2[2];
  union {
    __IO uint16_t BGR;
    struct {
      __IO  uint8_t BGR0;
      __IO  uint8_t BGR1;
    };
  };
}FM3_MFS03_CSIO_TypeDef;

/******************************************************************************
 * MFS03_LIN_MODULE
 ******************************************************************************/
/* UART LIN channel 0 registers */
typedef struct
{
  __IO  uint8_t SMR;
  __IO  uint8_t SCR;
        uint8_t RESERVED0[2];
  __IO  uint8_t ESCR;
  __IO  uint8_t SSR;
        uint8_t RESERVED1[2];
  union {
    __IO uint16_t RDR;
    __IO uint16_t TDR;
  };
        uint8_t RESERVED2[2];
  union {
    __IO uint16_t BGR;
    struct {
      __IO  uint8_t BGR0;
      __IO  uint8_t BGR1;
    };
  };
}FM3_MFS03_LIN_TypeDef;

/******************************************************************************
 * MFS03_I2C_MODULE
 ******************************************************************************/
/* I2C channel 0 registers */
typedef struct
{
  __IO  uint8_t SMR;
  __IO  uint8_t IBCR;
        uint8_t RESERVED0[2];
  __IO  uint8_t IBSR;
  __IO  uint8_t SSR;
        uint8_t RESERVED1[2];
  union {
    __IO uint16_t RDR;
    __IO uint16_t TDR;
  };
        uint8_t RESERVED2[2];
  union {
    __IO uint16_t BGR;
    struct {
      __IO  uint8_t BGR0;
      __IO  uint8_t BGR1;
    };
  };
        uint8_t RESERVED3[2];
  __IO  uint8_t ISBA;
  __IO  uint8_t ISMK;
}FM3_MFS03_I2C_TypeDef;

/******************************************************************************
 * MFS47_UART_MODULE
 ******************************************************************************/
/* UART asynchronous channel 4 registers */
typedef struct
{
  __IO  uint8_t SMR;
  __IO  uint8_t SCR;
        uint8_t RESERVED0[2];
  __IO  uint8_t ESCR;
  __IO  uint8_t SSR;
        uint8_t RESERVED1[2];
  union {
    __IO uint16_t RDR;
    __IO uint16_t TDR;
  };
        uint8_t RESERVED2[2];
  union {
    __IO uint16_t BGR;
    struct {
      __IO  uint8_t BGR0;
      __IO  uint8_t BGR1;
    };
  };
        uint8_t RESERVED3[6];
  union {
    __IO uint16_t FCR;
    struct {
      __IO  uint8_t FCR0;
      __IO  uint8_t FCR1;
    };
  };
        uint8_t RESERVED4[2];
  union {
    __IO uint16_t FBYTE;
    struct {
      __IO  uint8_t FBYTE1;
      __IO  uint8_t FBYTE2;
    };
  };
}FM3_MFS47_UART_TypeDef;

